pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CORDIC</name>
            <description>desc CORDIC</description>
            <groupName>CORDIC</groupName>
            <baseAddress>0x40055000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CSR</name>
                    <description>desc CSR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x50</resetValue>
                    <resetMask>0xC1FF07FF</resetMask>
                    <fields>
                        <field>
                            <name>FUNC</name>
                            <description>desc FUNC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRECISION</name>
                            <description>desc PRECISION</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCALE</name>
                            <description>desc SCALE</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IEN</name>
                            <description>desc IEN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAREN</name>
                            <description>desc DMAREN</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAWEN</name>
                            <description>desc DMAWEN</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NRES</name>
                            <description>desc NRES</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NARGS</name>
                            <description>desc NARGS</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESSIZE</name>
                            <description>desc RESSIZE</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARGSIZE</name>
                            <description>desc ARGSIZE</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FLOAT</name>
                            <description>desc FLOAT</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTMOD</name>
                            <description>desc EXTMOD</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>desc BUSY</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RRDY</name>
                            <description>desc RRDY</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDATA</name>
                    <description>desc WDATA</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>RDATA</name>
                    <description>desc RDATA</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>INTEN</name>
                    <description>desc INTEN</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F1</resetMask>
                    <fields>
                        <field>
                            <name>ARG1_UP_OV_IEN</name>
                            <description>desc ARG1_UP_OV_IEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RES1_UP_OV_IEN</name>
                            <description>desc RES1_UP_OV_IEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RES1_DW_OV_IEN</name>
                            <description>desc RES1_DW_OV_IEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RES2_UP_OV_IEN</name>
                            <description>desc RES2_UP_OV_IEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RES2_DW_OV_IEN</name>
                            <description>desc RES2_DW_OV_IEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDATA_LOSS_IEN</name>
                            <description>desc WDATA_LOSS_IEN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISR</name>
                    <description>desc ISR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F1</resetMask>
                    <fields>
                        <field>
                            <name>ARG1_UP_OV_ISR</name>
                            <description>desc ARG1_UP_OV_ISR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RES1_UP_OV_ISR</name>
                            <description>desc RES1_UP_OV_ISR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RES1_DW_OV_ISR</name>
                            <description>desc RES1_DW_OV_ISR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RES2_UP_OV_ISR</name>
                            <description>desc RES2_UP_OV_ISR</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RES2_DW_OV_ISR</name>
                            <description>desc RES2_DW_OV_ISR</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WDATA_LOSS_ISR</name>
                            <description>desc WDATA_LOSS_ISR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICR</name>
                    <description>desc ICR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F1</resetMask>
                    <fields>
                        <field>
                            <name>ARG1_UP_OV_ICR</name>
                            <description>desc ARG1_UP_OV_ICR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RES1_UP_OV_ICR</name>
                            <description>desc RES1_UP_OV_ICR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RES1_DW_OV_ICR</name>
                            <description>desc RES1_DW_OV_ICR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RES2_UP_OV_ICR</name>
                            <description>desc RES2_UP_OV_ICR</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RES2_DW_OV_ICR</name>
                            <description>desc RES2_DW_OV_ICR</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>WDATA_LOSS_ICR</name>
                            <description>desc WDATA_LOSS_ICR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
