pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>DACR3</name>
                    <description>desc DACR3</description>
                    <addressOffset>0x34</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x303</resetValue>
                    <resetMask>0xF0F0</resetMask>
                    <fields>
                        <field>
                            <name>RAMPLOADSEL1</name>
                            <description>desc RAMPLOADSEL1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPSCTL1</name>
                            <description>desc CMPSCTL1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFSTDIR1</name>
                            <description>desc OFSTDIR1</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFSTMD1</name>
                            <description>desc OFSTMD1</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPLOADSEL2</name>
                            <description>desc RAMPLOADSEL2</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPSCTL2</name>
                            <description>desc CMPSCTL2</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFSTDIR2</name>
                            <description>desc OFSTDIR2</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFSTMD2</name>
                            <description>desc OFSTMD2</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DADRDE1</name>
                    <description>desc DADRDE1</description>
                    <addressOffset>0x38</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DADRDE2</name>
                    <description>desc DADRDE2</description>
                    <addressOffset>0x3A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DADROF1</name>
                    <description>desc DADROF1</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DADROF2</name>
                    <description>desc DADROF2</description>
                    <addressOffset>0x3E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>RAMPRSTDLYR1</name>
                    <description>desc RAMPRSTDLYR1</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>DARAMPRSTDLY</name>
                            <description>desc DARAMPRSTDLY</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMPRSTDLYR2</name>
                    <description>desc RAMPRSTDLYR2</description>
                    <addressOffset>0x4E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>DARAMPRSTDLY</name>
                            <description>desc DARAMPRSTDLY</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMPLMTACTR1</name>
                    <description>desc RAMPLMTACTR1</description>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RAMPLMTACT</name>
                            <description>desc RAMPLMTACT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMPLMTACTR2</name>
                    <description>desc RAMPLMTACTR2</description>
                    <addressOffset>0x52</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RAMPLMTACT</name>
                            <description>desc RAMPLMTACT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMPSTEPACTR1</name>
                    <description>desc RAMPSTEPACTR1</description>
                    <addressOffset>0x54</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RAMPSTEPACT</name>
                            <description>desc RAMPSTEPACT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMPSTEPACTR2</name>
                    <description>desc RAMPSTEPACTR2</description>
                    <addressOffset>0x56</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RAMPSTEPACT</name>
                            <description>desc RAMPSTEPACT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMPRSTDLYACTR1</name>
                    <description>desc RAMPRSTDLYACTR1</description>
                    <addressOffset>0x58</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>DARAMPRSTDLYACT</name>
                            <description>desc DARAMPRSTDLYACT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMPRSTDLYACTR2</name>
                    <description>desc RAMPRSTDLYACTR2</description>
                    <addressOffset>0x5A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>DARAMPRSTDLYACT</name>
                            <description>desc DARAMPRSTDLYACT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
