pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>F1NWPRT</name>
                    <description>desc F1NWPRT</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>F1NWPRT0</name>
                            <description>desc F1NWPRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT1</name>
                            <description>desc F1NWPRT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT2</name>
                            <description>desc F1NWPRT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT3</name>
                            <description>desc F1NWPRT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT4</name>
                            <description>desc F1NWPRT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT5</name>
                            <description>desc F1NWPRT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT6</name>
                            <description>desc F1NWPRT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT7</name>
                            <description>desc F1NWPRT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT8</name>
                            <description>desc F1NWPRT8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT9</name>
                            <description>desc F1NWPRT9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT10</name>
                            <description>desc F1NWPRT10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT11</name>
                            <description>desc F1NWPRT11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT12</name>
                            <description>desc F1NWPRT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT13</name>
                            <description>desc F1NWPRT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT14</name>
                            <description>desc F1NWPRT14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT15</name>
                            <description>desc F1NWPRT15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT16</name>
                            <description>desc F1NWPRT16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT17</name>
                            <description>desc F1NWPRT17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT18</name>
                            <description>desc F1NWPRT18</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT19</name>
                            <description>desc F1NWPRT19</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT20</name>
                            <description>desc F1NWPRT20</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT21</name>
                            <description>desc F1NWPRT21</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT22</name>
                            <description>desc F1NWPRT22</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT23</name>
                            <description>desc F1NWPRT23</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT24</name>
                            <description>desc F1NWPRT24</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT25</name>
                            <description>desc F1NWPRT25</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT26</name>
                            <description>desc F1NWPRT26</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT27</name>
                            <description>desc F1NWPRT27</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT28</name>
                            <description>desc F1NWPRT28</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT29</name>
                            <description>desc F1NWPRT29</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT30</name>
                            <description>desc F1NWPRT30</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT31</name>
                            <description>desc F1NWPRT31</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKCR</name>
                    <description>desc CKCR</description>
                    <addressOffset>0x350</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3010301</resetMask>
                    <fields>
                        <field>
                            <name>F0ECCOAD</name>
                            <description>desc F0ECCOAD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0ECCMOD</name>
                            <description>desc F0ECCMOD</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1ECCOAD</name>
                            <description>desc F1ECCOAD</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1ECCMOD</name>
                            <description>desc F1ECCMOD</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKPR</name>
                    <description>desc CKPR</description>
                    <addressOffset>0x354</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CKPRC</name>
                            <description>desc CKPRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKPRKW</name>
                            <description>desc CKPRKW</description>
                            <msb>7</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKSR</name>
                    <description>desc CKSR</description>
                    <addressOffset>0x358</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x30003</resetMask>
                    <fields>
                        <field>
                            <name>F0_1ERR</name>
                            <description>desc F0_1ERR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0_2ERR</name>
                            <description>desc F0_2ERR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1_1ERR</name>
                            <description>desc F1_1ERR</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1_2ERR</name>
                            <description>desc F1_2ERR</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIEN</name>
                    <description>desc EIEN</description>
                    <addressOffset>0x35C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x10001</resetMask>
                    <fields>
                        <field>
                            <name>F0_EIEN</name>
                            <description>desc F0_EIEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1_EIEN</name>
                            <description>desc F1_EIEN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0ECCCR</name>
                    <description>desc F0ECCCR</description>
                    <addressOffset>0x370</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>GDIS</name>
                            <description>desc GDIS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VDIS</name>
                            <description>desc VDIS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0ECCDR</name>
                    <description>desc F0ECCDR</description>
                    <addressOffset>0x374</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF01FF</resetMask>
                    <fields>
                        <field>
                            <name>DWD</name>
                            <description>desc DWD</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRD</name>
                            <description>desc DRD</description>
                            <msb>24</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0ERR0</name>
                    <description>desc F0ERR0</description>
                    <addressOffset>0x378</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF3</resetMask>
                    <fields>
                        <field>
                            <name>VALID</name>
                            <description>desc VALID</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FATAL</name>
                            <description>desc FATAL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INDEX</name>
                            <description>desc INDEX</description>
                            <msb>23</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0ERR1</name>
                    <description>desc F0ERR1</description>
                    <addressOffset>0x37C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF3</resetMask>
                    <fields>
                        <field>
                            <name>VALID</name>
                            <description>desc VALID</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FATAL</name>
                            <description>desc FATAL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INDEX</name>
                            <description>desc INDEX</description>
                            <msb>23</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0EIR0</name>
                    <description>desc F0EIR0</description>
                    <addressOffset>0x380</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>F0EIR1</name>
                    <description>desc F0EIR1</description>
                    <addressOffset>0x384</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>F0EIR2</name>
                    <description>desc F0EIR2</description>
                    <addressOffset>0x388</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>F0EIR3</name>
                    <description>desc F0EIR3</description>
                    <addressOffset>0x38C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>F0EIR4</name>
                    <description>desc F0EIR4</description>
                    <addressOffset>0x390</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
