pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>F1ECCCR</name>
                    <description>desc F1ECCCR</description>
                    <addressOffset>0x3B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>GDIS</name>
                            <description>desc GDIS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VDIS</name>
                            <description>desc VDIS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1ECCDR</name>
                    <description>desc F1ECCDR</description>
                    <addressOffset>0x3B4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF01FF</resetMask>
                    <fields>
                        <field>
                            <name>DWD</name>
                            <description>desc DWD</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRD</name>
                            <description>desc DRD</description>
                            <msb>24</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1ERR0</name>
                    <description>desc F1ERR0</description>
                    <addressOffset>0x3B8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF3</resetMask>
                    <fields>
                        <field>
                            <name>VALID</name>
                            <description>desc VALID</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FATAL</name>
                            <description>desc FATAL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INDEX</name>
                            <description>desc INDEX</description>
                            <msb>23</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1ERR1</name>
                    <description>desc F1ERR1</description>
                    <addressOffset>0x3BC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF3</resetMask>
                    <fields>
                        <field>
                            <name>VALID</name>
                            <description>desc VALID</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FATAL</name>
                            <description>desc FATAL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INDEX</name>
                            <description>desc INDEX</description>
                            <msb>23</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1EIR0</name>
                    <description>desc F1EIR0</description>
                    <addressOffset>0x3C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>F1EIR1</name>
                    <description>desc F1EIR1</description>
                    <addressOffset>0x3C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>F1EIR2</name>
                    <description>desc F1EIR2</description>
                    <addressOffset>0x3C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>F1EIR3</name>
                    <description>desc F1EIR3</description>
                    <addressOffset>0x3CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>F1EIR4</name>
                    <description>desc F1EIR4</description>
                    <addressOffset>0x3D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
