pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>IIR_CR1</name>
                    <description>desc IIR_CR1</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3F3F3F</resetMask>
                    <fields>
                        <field>
                            <name>CH1_START</name>
                            <description>desc CH1_START</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_START</name>
                            <description>desc CH2_START</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_START</name>
                            <description>desc CH3_START</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_START</name>
                            <description>desc CH4_START</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_START</name>
                            <description>desc CH5_START</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_START</name>
                            <description>desc CH6_START</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_CAL_MODE</name>
                            <description>desc CH1_CAL_MODE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_CAL_MODE</name>
                            <description>desc CH2_CAL_MODE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_CAL_MODE</name>
                            <description>desc CH3_CAL_MODE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_CAL_MODE</name>
                            <description>desc CH4_CAL_MODE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_CAL_MODE</name>
                            <description>desc CH5_CAL_MODE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_CAL_MODE</name>
                            <description>desc CH6_CAL_MODE</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_DATA_TYPE</name>
                            <description>desc CH1_DATA_TYPE</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_DATA_TYPE</name>
                            <description>desc CH2_DATA_TYPE</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_DATA_TYPE</name>
                            <description>desc CH3_DATA_TYPE</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_DATA_TYPE</name>
                            <description>desc CH4_DATA_TYPE</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_DATA_TYPE</name>
                            <description>desc CH5_DATA_TYPE</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_DATA_TYPE</name>
                            <description>desc CH6_DATA_TYPE</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_ENABLE</name>
                            <description>desc CH1_ENABLE</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_ENABLE</name>
                            <description>desc CH2_ENABLE</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_ENABLE</name>
                            <description>desc CH3_ENABLE</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_ENABLE</name>
                            <description>desc CH4_ENABLE</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_ENABLE</name>
                            <description>desc CH5_ENABLE</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_ENABLE</name>
                            <description>desc CH6_ENABLE</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_CR2</name>
                    <description>desc IIR_CR2</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F033F3F</resetMask>
                    <fields>
                        <field>
                            <name>CH1_DCLR</name>
                            <description>desc CH1_DCLR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_DCLR</name>
                            <description>desc CH2_DCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_DCLR</name>
                            <description>desc CH3_DCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_DCLR</name>
                            <description>desc CH4_DCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_DCLR</name>
                            <description>desc CH5_DCLR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_DCLR</name>
                            <description>desc CH6_DCLR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_RST</name>
                            <description>desc CH1_RST</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_RST</name>
                            <description>desc CH2_RST</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_RST</name>
                            <description>desc CH3_RST</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_RST</name>
                            <description>desc CH4_RST</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_RST</name>
                            <description>desc CH5_RST</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_RST</name>
                            <description>desc CH6_RST</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_TH_EN</name>
                            <description>desc CH1_TH_EN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_TH_EN</name>
                            <description>desc CH2_TH_EN</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_UNRD_PRO</name>
                            <description>desc CH1_UNRD_PRO</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_UNRD_PRO</name>
                            <description>desc CH2_UNRD_PRO</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_UNRD_PRO</name>
                            <description>desc CH3_UNRD_PRO</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_UNRD_PRO</name>
                            <description>desc CH4_UNRD_PRO</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_UNRD_PRO</name>
                            <description>desc CH5_UNRD_PRO</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_UNRD_PRO</name>
                            <description>desc CH6_UNRD_PRO</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_INT_CR</name>
                    <description>desc IIR_INT_CR</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>CH1_DONE_EN</name>
                            <description>desc CH1_DONE_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_DONE_EN</name>
                            <description>desc CH2_DONE_EN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_DONE_EN</name>
                            <description>desc CH3_DONE_EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_DONE_EN</name>
                            <description>desc CH4_DONE_EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_DONE_EN</name>
                            <description>desc CH5_DONE_EN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_DONE_EN</name>
                            <description>desc CH6_DONE_EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_STA1</name>
                    <description>desc IIR_STA1</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3F</resetMask>
                    <fields>
                        <field>
                            <name>CH1_START_ERR</name>
                            <description>desc CH1_START_ERR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_START_ERR</name>
                            <description>desc CH2_START_ERR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_START_ERR</name>
                            <description>desc CH3_START_ERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_START_ERR</name>
                            <description>desc CH4_START_ERR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_START_ERR</name>
                            <description>desc CH5_START_ERR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_START_ERR</name>
                            <description>desc CH6_START_ERR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_DATA_RDY</name>
                            <description>desc CH1_DATA_RDY</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_DATA_RDY</name>
                            <description>desc CH2_DATA_RDY</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_DATA_RDY</name>
                            <description>desc CH3_DATA_RDY</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_DATA_RDY</name>
                            <description>desc CH4_DATA_RDY</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_DATA_RDY</name>
                            <description>desc CH5_DATA_RDY</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_DATA_RDY</name>
                            <description>desc CH6_DATA_RDY</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
