pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>IIR_STA2</name>
                    <description>desc IIR_STA2</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3F3F</resetMask>
                    <fields>
                        <field>
                            <name>CH1_INF</name>
                            <description>desc CH1_INF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_INF</name>
                            <description>desc CH2_INF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_INF</name>
                            <description>desc CH3_INF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_INF</name>
                            <description>desc CH4_INF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_INF</name>
                            <description>desc CH5_INF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_INF</name>
                            <description>desc CH6_INF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_NAN</name>
                            <description>desc CH1_NAN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_NAN</name>
                            <description>desc CH2_NAN</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_NAN</name>
                            <description>desc CH3_NAN</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_NAN</name>
                            <description>desc CH4_NAN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_NAN</name>
                            <description>desc CH5_NAN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_NAN</name>
                            <description>desc CH6_NAN</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_OOR</name>
                            <description>desc CH1_OOR</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_OOR</name>
                            <description>desc CH2_OOR</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_OOR</name>
                            <description>desc CH3_OOR</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_OOR</name>
                            <description>desc CH4_OOR</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_OOR</name>
                            <description>desc CH5_OOR</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_OOR</name>
                            <description>desc CH6_OOR</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_BUF_STA</name>
                    <description>desc IIR_BUF_STA</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3F3F</resetMask>
                    <fields>
                        <field>
                            <name>CH1_XFULL</name>
                            <description>desc CH1_XFULL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_XFULL</name>
                            <description>desc CH2_XFULL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_XFULL</name>
                            <description>desc CH3_XFULL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_XFULL</name>
                            <description>desc CH4_XFULL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_XFULL</name>
                            <description>desc CH5_XFULL</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_XFULL</name>
                            <description>desc CH6_XFULL</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_YFULL</name>
                            <description>desc CH1_YFULL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_YFULL</name>
                            <description>desc CH2_YFULL</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_YFULL</name>
                            <description>desc CH3_YFULL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_YFULL</name>
                            <description>desc CH4_YFULL</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_YFULL</name>
                            <description>desc CH5_YFULL</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_YFULL</name>
                            <description>desc CH6_YFULL</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1_CFULL</name>
                            <description>desc CH1_CFULL</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH2_CFULL</name>
                            <description>desc CH2_CFULL</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH3_CFULL</name>
                            <description>desc CH3_CFULL</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH4_CFULL</name>
                            <description>desc CH4_CFULL</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH5_CFULL</name>
                            <description>desc CH5_CFULL</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH6_CFULL</name>
                            <description>desc CH6_CFULL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_CH1_PARM</name>
                    <description>desc IIR_CH1_PARM</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0xF0707</resetMask>
                    <fields>
                        <field>
                            <name>X_NUM</name>
                            <description>desc X_NUM</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y_NUM</name>
                            <description>desc Y_NUM</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>C_NUM</name>
                            <description>desc C_NUM</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_CH2_PARM</name>
                    <description>desc IIR_CH2_PARM</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0xF0707</resetMask>
                    <fields>
                        <field>
                            <name>X_NUM</name>
                            <description>desc X_NUM</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y_NUM</name>
                            <description>desc Y_NUM</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>C_NUM</name>
                            <description>desc C_NUM</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_CH3_PARM</name>
                    <description>desc IIR_CH3_PARM</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0xF0707</resetMask>
                    <fields>
                        <field>
                            <name>X_NUM</name>
                            <description>desc X_NUM</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y_NUM</name>
                            <description>desc Y_NUM</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>C_NUM</name>
                            <description>desc C_NUM</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_CH4_PARM</name>
                    <description>desc IIR_CH4_PARM</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0xF0707</resetMask>
                    <fields>
                        <field>
                            <name>X_NUM</name>
                            <description>desc X_NUM</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y_NUM</name>
                            <description>desc Y_NUM</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>C_NUM</name>
                            <description>desc C_NUM</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_CH5_PARM</name>
                    <description>desc IIR_CH5_PARM</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0xF0707</resetMask>
                    <fields>
                        <field>
                            <name>X_NUM</name>
                            <description>desc X_NUM</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y_NUM</name>
                            <description>desc Y_NUM</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>C_NUM</name>
                            <description>desc C_NUM</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_CH6_PARM</name>
                    <description>desc IIR_CH6_PARM</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0xF0707</resetMask>
                    <fields>
                        <field>
                            <name>X_NUM</name>
                            <description>desc X_NUM</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y_NUM</name>
                            <description>desc Y_NUM</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>C_NUM</name>
                            <description>desc C_NUM</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_YRDATA1</name>
                    <description>desc IIR_YRDATA1</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YRDATA2</name>
                    <description>desc IIR_YRDATA2</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YRDATA3</name>
                    <description>desc IIR_YRDATA3</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YRDATA4</name>
                    <description>desc IIR_YRDATA4</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YRDATA5</name>
                    <description>desc IIR_YRDATA5</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YRDATA6</name>
                    <description>desc IIR_YRDATA6</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_XWDATA1</name>
                    <description>desc IIR_XWDATA1</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
