pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>IIR_XWDATA2</name>
                    <description>desc IIR_XWDATA2</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_XWDATA3</name>
                    <description>desc IIR_XWDATA3</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_XWDATA4</name>
                    <description>desc IIR_XWDATA4</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_XWDATA5</name>
                    <description>desc IIR_XWDATA5</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_XWDATA6</name>
                    <description>desc IIR_XWDATA6</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_CWDATA1</name>
                    <description>desc IIR_CWDATA1</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_CWDATA2</name>
                    <description>desc IIR_CWDATA2</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_CWDATA3</name>
                    <description>desc IIR_CWDATA3</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_CWDATA4</name>
                    <description>desc IIR_CWDATA4</description>
                    <addressOffset>0xEC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_CWDATA5</name>
                    <description>desc IIR_CWDATA5</description>
                    <addressOffset>0xF0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_CWDATA6</name>
                    <description>desc IIR_CWDATA6</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YWDATA1</name>
                    <description>desc IIR_YWDATA1</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YWDATA2</name>
                    <description>desc IIR_YWDATA2</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YWDATA3</name>
                    <description>desc IIR_YWDATA3</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YWDATA4</name>
                    <description>desc IIR_YWDATA4</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YWDATA5</name>
                    <description>desc IIR_YWDATA5</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YWDATA6</name>
                    <description>desc IIR_YWDATA6</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YMAX1</name>
                    <description>desc IIR_YMAX1</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YMAX2</name>
                    <description>desc IIR_YMAX2</description>
                    <addressOffset>0x124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YMIN1</name>
                    <description>desc IIR_YMIN1</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_YMIN2</name>
                    <description>desc IIR_YMIN2</description>
                    <addressOffset>0x144</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_DATA_CR1</name>
                    <description>desc IIR_DATA_CR1</description>
                    <addressOffset>0x160</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>XSEL</name>
                            <description>desc XSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_DATA_CR2</name>
                    <description>desc IIR_DATA_CR2</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>XSEL</name>
                            <description>desc XSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_DATA_CR3</name>
                    <description>desc IIR_DATA_CR3</description>
                    <addressOffset>0x168</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>XSEL</name>
                            <description>desc XSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_DATA_CR4</name>
                    <description>desc IIR_DATA_CR4</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>XSEL</name>
                            <description>desc XSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_DATA_CR5</name>
                    <description>desc IIR_DATA_CR5</description>
                    <addressOffset>0x170</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>XSEL</name>
                            <description>desc XSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_DATA_CR6</name>
                    <description>desc IIR_DATA_CR6</description>
                    <addressOffset>0x174</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>XSEL</name>
                            <description>desc XSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_SRADDR1</name>
                    <description>desc IIR_SRADDR1</description>
                    <addressOffset>0x180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_SRADDRX</name>
                            <description>desc IIR_SRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRY</name>
                            <description>desc IIR_SRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRC</name>
                            <description>desc IIR_SRADDRC</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_SRADDR2</name>
                    <description>desc IIR_SRADDR2</description>
                    <addressOffset>0x184</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_SRADDRX</name>
                            <description>desc IIR_SRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRY</name>
                            <description>desc IIR_SRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRC</name>
                            <description>desc IIR_SRADDRC</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_SRADDR3</name>
                    <description>desc IIR_SRADDR3</description>
                    <addressOffset>0x188</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_SRADDRX</name>
                            <description>desc IIR_SRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRY</name>
                            <description>desc IIR_SRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRC</name>
                            <description>desc IIR_SRADDRC</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_SRADDR4</name>
                    <description>desc IIR_SRADDR4</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_SRADDRX</name>
                            <description>desc IIR_SRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRY</name>
                            <description>desc IIR_SRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRC</name>
                            <description>desc IIR_SRADDRC</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_SRADDR5</name>
                    <description>desc IIR_SRADDR5</description>
                    <addressOffset>0x190</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_SRADDRX</name>
                            <description>desc IIR_SRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRY</name>
                            <description>desc IIR_SRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRC</name>
                            <description>desc IIR_SRADDRC</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_SRADDR6</name>
                    <description>desc IIR_SRADDR6</description>
                    <addressOffset>0x194</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_SRADDRX</name>
                            <description>desc IIR_SRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRY</name>
                            <description>desc IIR_SRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIR_SRADDRC</name>
                            <description>desc IIR_SRADDRC</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_SRDATAX1</name>
                    <description>desc IIR_SRDATAX1</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAX2</name>
                    <description>desc IIR_SRDATAX2</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAX3</name>
                    <description>desc IIR_SRDATAX3</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAX4</name>
                    <description>desc IIR_SRDATAX4</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAX5</name>
                    <description>desc IIR_SRDATAX5</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
