pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>IIR_SRDATAX6</name>
                    <description>desc IIR_SRDATAX6</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAC1</name>
                    <description>desc IIR_SRDATAC1</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAC2</name>
                    <description>desc IIR_SRDATAC2</description>
                    <addressOffset>0x1C4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAC3</name>
                    <description>desc IIR_SRDATAC3</description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAC4</name>
                    <description>desc IIR_SRDATAC4</description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAC5</name>
                    <description>desc IIR_SRDATAC5</description>
                    <addressOffset>0x1D0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAC6</name>
                    <description>desc IIR_SRDATAC6</description>
                    <addressOffset>0x1D4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAY1</name>
                    <description>desc IIR_SRDATAY1</description>
                    <addressOffset>0x1E0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAY2</name>
                    <description>desc IIR_SRDATAY2</description>
                    <addressOffset>0x1E4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAY3</name>
                    <description>desc IIR_SRDATAY3</description>
                    <addressOffset>0x1E8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAY4</name>
                    <description>desc IIR_SRDATAY4</description>
                    <addressOffset>0x1EC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAY5</name>
                    <description>desc IIR_SRDATAY5</description>
                    <addressOffset>0x1F0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_SRDATAY6</name>
                    <description>desc IIR_SRDATAY6</description>
                    <addressOffset>0x1F5</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IIR_HADDR1</name>
                    <description>desc IIR_HADDR1</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_HRADDRX</name>
                            <description>desc IIR_HRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HRADDRY</name>
                            <description>desc IIR_HRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HWADDRX</name>
                            <description>desc IIR_HWADDRX</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_HADDR2</name>
                    <description>desc IIR_HADDR2</description>
                    <addressOffset>0x204</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_HRADDRX</name>
                            <description>desc IIR_HRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HRADDRY</name>
                            <description>desc IIR_HRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HWADDRX</name>
                            <description>desc IIR_HWADDRX</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_HADDR3</name>
                    <description>desc IIR_HADDR3</description>
                    <addressOffset>0x208</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_HRADDRX</name>
                            <description>desc IIR_HRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HRADDRY</name>
                            <description>desc IIR_HRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HWADDRX</name>
                            <description>desc IIR_HWADDRX</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_HADDR4</name>
                    <description>desc IIR_HADDR4</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_HRADDRX</name>
                            <description>desc IIR_HRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HRADDRY</name>
                            <description>desc IIR_HRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HWADDRX</name>
                            <description>desc IIR_HWADDRX</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_HADDR5</name>
                    <description>desc IIR_HADDR5</description>
                    <addressOffset>0x210</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_HRADDRX</name>
                            <description>desc IIR_HRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HRADDRY</name>
                            <description>desc IIR_HRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HWADDRX</name>
                            <description>desc IIR_HWADDRX</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR_HADDR6</name>
                    <description>desc IIR_HADDR6</description>
                    <addressOffset>0x214</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70307</resetMask>
                    <fields>
                        <field>
                            <name>IIR_HRADDRX</name>
                            <description>desc IIR_HRADDRX</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HRADDRY</name>
                            <description>desc IIR_HRADDRY</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIR_HWADDRX</name>
                            <description>desc IIR_HWADDRX</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
