pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>PCNAR2</name>
                    <description>desc PCNAR2</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA00AAAAA</resetValue>
                    <resetMask>0xCFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1UCA</name>
                            <description>desc EXEV1UCA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2UCA</name>
                            <description>desc EXEV2UCA</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3UCA</name>
                            <description>desc EXEV3UCA</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4UCA</name>
                            <description>desc EXEV4UCA</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5UCA</name>
                            <description>desc EXEV5UCA</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6UCA</name>
                            <description>desc EXEV6UCA</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7UCA</name>
                            <description>desc EXEV7UCA</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8UCA</name>
                            <description>desc EXEV8UCA</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9UCA</name>
                            <description>desc EXEV9UCA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10UCA</name>
                            <description>desc EXEV10UCA</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEUCA</name>
                            <description>desc CMEUCA</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFUCA</name>
                            <description>desc CMFUCA</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMAUCA</name>
                            <description>desc SCMAUCA</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBUCA</name>
                            <description>desc SCMBUCA</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFTUCA</name>
                            <description>desc SFTUCA</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPCNAR2</name>
                    <description>desc BPCNAR2</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA00AAAAA</resetValue>
                    <resetMask>0xCFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1UCA</name>
                            <description>desc EXEV1UCA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2UCA</name>
                            <description>desc EXEV2UCA</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3UCA</name>
                            <description>desc EXEV3UCA</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4UCA</name>
                            <description>desc EXEV4UCA</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5UCA</name>
                            <description>desc EXEV5UCA</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6UCA</name>
                            <description>desc EXEV6UCA</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7UCA</name>
                            <description>desc EXEV7UCA</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8UCA</name>
                            <description>desc EXEV8UCA</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9UCA</name>
                            <description>desc EXEV9UCA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10UCA</name>
                            <description>desc EXEV10UCA</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEUCA</name>
                            <description>desc CMEUCA</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFUCA</name>
                            <description>desc CMFUCA</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMAUCA</name>
                            <description>desc SCMAUCA</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBUCA</name>
                            <description>desc SCMBUCA</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFTUCA</name>
                            <description>desc SFTUCA</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNAR3</name>
                    <description>desc PCNAR3</description>
                    <addressOffset>0xD8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA00AAAAA</resetValue>
                    <resetMask>0xCFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1DCA</name>
                            <description>desc EXEV1DCA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2DCA</name>
                            <description>desc EXEV2DCA</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3DCA</name>
                            <description>desc EXEV3DCA</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4DCA</name>
                            <description>desc EXEV4DCA</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5DCA</name>
                            <description>desc EXEV5DCA</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6DCA</name>
                            <description>desc EXEV6DCA</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7DCA</name>
                            <description>desc EXEV7DCA</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8DCA</name>
                            <description>desc EXEV8DCA</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9DCA</name>
                            <description>desc EXEV9DCA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10DCA</name>
                            <description>desc EXEV10DCA</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEDCA</name>
                            <description>desc CMEDCA</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFDCA</name>
                            <description>desc CMFDCA</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMADCA</name>
                            <description>desc SCMADCA</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBDCA</name>
                            <description>desc SCMBDCA</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFTDCA</name>
                            <description>desc SFTDCA</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPCNAR3</name>
                    <description>desc BPCNAR3</description>
                    <addressOffset>0xDC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA00AAAAA</resetValue>
                    <resetMask>0xCFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1DCA</name>
                            <description>desc EXEV1DCA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2DCA</name>
                            <description>desc EXEV2DCA</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3DCA</name>
                            <description>desc EXEV3DCA</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4DCA</name>
                            <description>desc EXEV4DCA</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5DCA</name>
                            <description>desc EXEV5DCA</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6DCA</name>
                            <description>desc EXEV6DCA</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7DCA</name>
                            <description>desc EXEV7DCA</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8DCA</name>
                            <description>desc EXEV8DCA</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9DCA</name>
                            <description>desc EXEV9DCA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10DCA</name>
                            <description>desc EXEV10DCA</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEDCA</name>
                            <description>desc CMEDCA</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFDCA</name>
                            <description>desc CMFDCA</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMADCA</name>
                            <description>desc SCMADCA</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBDCA</name>
                            <description>desc SCMBDCA</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFTDCA</name>
                            <description>desc SFTDCA</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
