pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>BPCNBR1</name>
                    <description>desc BPCNBR1</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>STACB</name>
                            <description>desc STACB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STPCB</name>
                            <description>desc STPCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFCB</name>
                            <description>desc OVFCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDFCB</name>
                            <description>desc UDFCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMAUCB</name>
                            <description>desc CMAUCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMADCB</name>
                            <description>desc CMADCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBUCB</name>
                            <description>desc CMBUCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBDCB</name>
                            <description>desc CMBDCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCB</name>
                            <description>desc FORCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBCB</name>
                            <description>desc EMBCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBRB</name>
                            <description>desc EMBRB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBSB</name>
                            <description>desc EMBSB</description>
                            <msb>27</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTENB</name>
                            <description>desc OUTENB</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNBR2</name>
                    <description>desc PCNBR2</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA00AAAAA</resetValue>
                    <resetMask>0xCFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1UCB</name>
                            <description>desc EXEV1UCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2UCB</name>
                            <description>desc EXEV2UCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3UCB</name>
                            <description>desc EXEV3UCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4UCB</name>
                            <description>desc EXEV4UCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5UCB</name>
                            <description>desc EXEV5UCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6UCB</name>
                            <description>desc EXEV6UCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7UCB</name>
                            <description>desc EXEV7UCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8UCB</name>
                            <description>desc EXEV8UCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9UCB</name>
                            <description>desc EXEV9UCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10UCB</name>
                            <description>desc EXEV10UCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEUCB</name>
                            <description>desc CMEUCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFUCB</name>
                            <description>desc CMFUCB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMAUCB</name>
                            <description>desc SCMAUCB</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBUCB</name>
                            <description>desc SCMBUCB</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFTUCB</name>
                            <description>desc SFTUCB</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPCNBR2</name>
                    <description>desc BPCNBR2</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA00AAAAA</resetValue>
                    <resetMask>0xCFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1UCB</name>
                            <description>desc EXEV1UCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2UCB</name>
                            <description>desc EXEV2UCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3UCB</name>
                            <description>desc EXEV3UCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4UCB</name>
                            <description>desc EXEV4UCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5UCB</name>
                            <description>desc EXEV5UCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6UCB</name>
                            <description>desc EXEV6UCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7UCB</name>
                            <description>desc EXEV7UCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8UCB</name>
                            <description>desc EXEV8UCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9UCB</name>
                            <description>desc EXEV9UCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10UCB</name>
                            <description>desc EXEV10UCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEUCB</name>
                            <description>desc CMEUCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFUCB</name>
                            <description>desc CMFUCB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMAUCB</name>
                            <description>desc SCMAUCB</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBUCB</name>
                            <description>desc SCMBUCB</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFTUCB</name>
                            <description>desc SFTUCB</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNBR3</name>
                    <description>desc PCNBR3</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA00AAAAA</resetValue>
                    <resetMask>0xCFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1DCB</name>
                            <description>desc EXEV1DCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2DCB</name>
                            <description>desc EXEV2DCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3DCB</name>
                            <description>desc EXEV3DCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4DCB</name>
                            <description>desc EXEV4DCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5DCB</name>
                            <description>desc EXEV5DCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6DCB</name>
                            <description>desc EXEV6DCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7DCB</name>
                            <description>desc EXEV7DCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8DCB</name>
                            <description>desc EXEV8DCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9DCB</name>
                            <description>desc EXEV9DCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10DCB</name>
                            <description>desc EXEV10DCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEDCB</name>
                            <description>desc CMEDCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFDCB</name>
                            <description>desc CMFDCB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMADCB</name>
                            <description>desc SCMADCB</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBDCB</name>
                            <description>desc SCMBDCB</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFTDCB</name>
                            <description>desc SFTDCB</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
