pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>BPCNBR24</name>
                    <description>desc BPCNBR24</description>
                    <alternateRegister>BPCNBR14</alternateRegister>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAAAAA</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>U1OVFUCB</name>
                            <description>desc U1OVFUCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1UDFUCB</name>
                            <description>desc U1UDFUCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1CMFUCB</name>
                            <description>desc U1CMFUCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1CMEUCB</name>
                            <description>desc U1CMEUCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1CMBUCB</name>
                            <description>desc U1CMBUCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1CMAUCB</name>
                            <description>desc U1CMAUCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT1UCB</name>
                            <description>desc TMEVT1UCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT2UCB</name>
                            <description>desc TMEVT2UCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT3UCB</name>
                            <description>desc TMEVT3UCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT4UCB</name>
                            <description>desc TMEVT4UCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT5UCB</name>
                            <description>desc TMEVT5UCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT6UCB</name>
                            <description>desc TMEVT6UCB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT7UCB</name>
                            <description>desc TMEVT7UCB</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT8UCB</name>
                            <description>desc TMEVT8UCB</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT9UCB</name>
                            <description>desc TMEVT9UCB</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT10UCB</name>
                            <description>desc TMEVT10UCB</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNBR15</name>
                    <description>desc PCNBR15</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAAAAA</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TMEVT1DCB</name>
                            <description>desc TMEVT1DCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT2DCB</name>
                            <description>desc TMEVT2DCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT3DCB</name>
                            <description>desc TMEVT3DCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT4DCB</name>
                            <description>desc TMEVT4DCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT5DCB</name>
                            <description>desc TMEVT5DCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT6DCB</name>
                            <description>desc TMEVT6DCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT7DCB</name>
                            <description>desc TMEVT7DCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT8DCB</name>
                            <description>desc TMEVT8DCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT9DCB</name>
                            <description>desc TMEVT9DCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT10DCB</name>
                            <description>desc TMEVT10DCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNBR25</name>
                    <description>desc PCNBR25</description>
                    <alternateRegister>PCNBR15</alternateRegister>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAAAAA</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>U1OVFDCB</name>
                            <description>desc U1OVFDCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1UDFDCB</name>
                            <description>desc U1UDFDCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1CMFDCB</name>
                            <description>desc U1CMFDCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1CMEDCB</name>
                            <description>desc U1CMEDCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1CMBDCB</name>
                            <description>desc U1CMBDCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U1CMADCB</name>
                            <description>desc U1CMADCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT1DCB</name>
                            <description>desc TMEVT1DCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT2DCB</name>
                            <description>desc TMEVT2DCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT3DCB</name>
                            <description>desc TMEVT3DCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT4DCB</name>
                            <description>desc TMEVT4DCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT5DCB</name>
                            <description>desc TMEVT5DCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT6DCB</name>
                            <description>desc TMEVT6DCB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT7DCB</name>
                            <description>desc TMEVT7DCB</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT8DCB</name>
                            <description>desc TMEVT8DCB</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT9DCB</name>
                            <description>desc TMEVT9DCB</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT10DCB</name>
                            <description>desc TMEVT10DCB</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPCNBR15</name>
                    <description>desc BPCNBR15</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAAAAA</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TMEVT1DCB</name>
                            <description>desc TMEVT1DCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT2DCB</name>
                            <description>desc TMEVT2DCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT3DCB</name>
                            <description>desc TMEVT3DCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT4DCB</name>
                            <description>desc TMEVT4DCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT5DCB</name>
                            <description>desc TMEVT5DCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT6DCB</name>
                            <description>desc TMEVT6DCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT7DCB</name>
                            <description>desc TMEVT7DCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT8DCB</name>
                            <description>desc TMEVT8DCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT9DCB</name>
                            <description>desc TMEVT9DCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMEVT10DCB</name>
                            <description>desc TMEVT10DCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
