pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="HRPWM1">
            <name>HRPWM2</name>
            <description>desc HRPWM</description>
            <groupName>HRPWM</groupName>
            <baseAddress>0x40034400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM1">
            <name>HRPWM3</name>
            <description>desc HRPWM</description>
            <groupName>HRPWM</groupName>
            <baseAddress>0x40034800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM1">
            <name>HRPWM4</name>
            <description>desc HRPWM</description>
            <groupName>HRPWM</groupName>
            <baseAddress>0x40034C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM1">
            <name>HRPWM5</name>
            <description>desc HRPWM</description>
            <groupName>HRPWM</groupName>
            <baseAddress>0x40035000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM1">
            <name>HRPWM6</name>
            <description>desc HRPWM</description>
            <groupName>HRPWM</groupName>
            <baseAddress>0x40035400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM1">
            <name>HRPWM7</name>
            <description>desc HRPWM</description>
            <groupName>HRPWM</groupName>
            <baseAddress>0x40035800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM1">
            <name>HRPWM8</name>
            <description>desc HRPWM</description>
            <groupName>HRPWM</groupName>
            <baseAddress>0x40035C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>HRPWM_COMMON</name>
            <description>desc HRPWM_COMMON</description>
            <groupName>HRPWM_COMMON</groupName>
            <baseAddress>0x40036800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x14C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CALCR</name>
                    <description>desc CALCR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x73F</resetMask>
                    <fields>
                        <field>
                            <name>CAL</name>
                            <description>desc CAL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALEN</name>
                            <description>desc CALEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALPRD</name>
                            <description>desc CALPRD</description>
                            <msb>5</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALENF</name>
                            <description>desc CALENF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRF</name>
                            <description>desc ERRF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALIE</name>
                            <description>desc CALIE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GLAOSSELR7</name>
                    <description>desc GLAOSSELR7</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F7FFF</resetMask>
                    <fields>
                        <field>
                            <name>GLAOSSEL7</name>
                            <description>desc GLAOSSEL7</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GLAOSSEL8</name>
                            <description>desc GLAOSSEL8</description>
                            <msb>9</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GLAOSSEL9</name>
                            <description>desc GLAOSSEL9</description>
                            <msb>14</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GLAOSSEL10</name>
                            <description>desc GLAOSSEL10</description>
                            <msb>20</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GLAOSSELR6</name>
                    <description>desc GLAOSSELR6</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF0FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMSA4</name>
                            <description>desc CMSA4</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB4</name>
                            <description>desc CMSB4</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF4</name>
                            <description>desc OVF4</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF4</name>
                            <description>desc UDF4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSA5</name>
                            <description>desc CMSA5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB5</name>
                            <description>desc CMSB5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF5</name>
                            <description>desc OVF5</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF5</name>
                            <description>desc UDF5</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSA6</name>
                            <description>desc CMSA6</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB6</name>
                            <description>desc CMSB6</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF6</name>
                            <description>desc OVF6</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF6</name>
                            <description>desc UDF6</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSA7</name>
                            <description>desc CMSA7</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB7</name>
                            <description>desc CMSB7</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF7</name>
                            <description>desc OVF7</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF7</name>
                            <description>desc UDF7</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSA8</name>
                            <description>desc CMSA8</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB8</name>
                            <description>desc CMSB8</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF8</name>
                            <description>desc OVF8</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF8</name>
                            <description>desc UDF8</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEV3</name>
                            <description>desc EEV3</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEV4</name>
                            <description>desc EEV4</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEV5</name>
                            <description>desc EEV5</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEV6</name>
                            <description>desc EEV6</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEV7</name>
                            <description>desc EEV7</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEV8</name>
                            <description>desc EEV8</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEV9</name>
                            <description>desc EEV9</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEV10</name>
                            <description>desc EEV10</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
