pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>SFTSRR</name>
                    <description>desc SFTSRR</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00FF</resetMask>
                    <fields>
                        <field>
                            <name>SFTSRA1</name>
                            <description>desc SFTSRA1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRA2</name>
                            <description>desc SFTSRA2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRA3</name>
                            <description>desc SFTSRA3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRA4</name>
                            <description>desc SFTSRA4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRA5</name>
                            <description>desc SFTSRA5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRA6</name>
                            <description>desc SFTSRA6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRA7</name>
                            <description>desc SFTSRA7</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRA8</name>
                            <description>desc SFTSRA8</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRB1</name>
                            <description>desc SFTSRB1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRB2</name>
                            <description>desc SFTSRB2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRB3</name>
                            <description>desc SFTSRB3</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRB4</name>
                            <description>desc SFTSRB4</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRB5</name>
                            <description>desc SFTSRB5</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRB6</name>
                            <description>desc SFTSRB6</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRB7</name>
                            <description>desc SFTSRB7</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SFTSRB8</name>
                            <description>desc SFTSRB8</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCAPR</name>
                    <description>desc SCAPR</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCAP1A</name>
                            <description>desc SCAP1A</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP1B</name>
                            <description>desc SCAP1B</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP2A</name>
                            <description>desc SCAP2A</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP2B</name>
                            <description>desc SCAP2B</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP3A</name>
                            <description>desc SCAP3A</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP3B</name>
                            <description>desc SCAP3B</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP4A</name>
                            <description>desc SCAP4A</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP4B</name>
                            <description>desc SCAP4B</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP5A</name>
                            <description>desc SCAP5A</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP5B</name>
                            <description>desc SCAP5B</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP6A</name>
                            <description>desc SCAP6A</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP6B</name>
                            <description>desc SCAP6B</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP7A</name>
                            <description>desc SCAP7A</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP7B</name>
                            <description>desc SCAP7B</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP8A</name>
                            <description>desc SCAP8A</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP8B</name>
                            <description>desc SCAP8B</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTAIDLR</name>
                    <description>desc SSTAIDLR</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SSTAIDL1A</name>
                            <description>desc SSTAIDL1A</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL1B</name>
                            <description>desc SSTAIDL1B</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL2A</name>
                            <description>desc SSTAIDL2A</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL2B</name>
                            <description>desc SSTAIDL2B</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL3A</name>
                            <description>desc SSTAIDL3A</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL3B</name>
                            <description>desc SSTAIDL3B</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL4A</name>
                            <description>desc SSTAIDL4A</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL4B</name>
                            <description>desc SSTAIDL4B</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL5A</name>
                            <description>desc SSTAIDL5A</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL5B</name>
                            <description>desc SSTAIDL5B</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL6A</name>
                            <description>desc SSTAIDL6A</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL6B</name>
                            <description>desc SSTAIDL6B</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL7A</name>
                            <description>desc SSTAIDL7A</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL7B</name>
                            <description>desc SSTAIDL7B</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL8A</name>
                            <description>desc SSTAIDL8A</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL8B</name>
                            <description>desc SSTAIDL8B</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTARUNR1</name>
                    <description>desc SSTARUNR1</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SSTARUN1A</name>
                            <description>desc SSTARUN1A</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN1B</name>
                            <description>desc SSTARUN1B</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN2A</name>
                            <description>desc SSTARUN2A</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN2B</name>
                            <description>desc SSTARUN2B</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN3A</name>
                            <description>desc SSTARUN3A</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN3B</name>
                            <description>desc SSTARUN3B</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN4A</name>
                            <description>desc SSTARUN4A</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN4B</name>
                            <description>desc SSTARUN4B</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN5A</name>
                            <description>desc SSTARUN5A</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN5B</name>
                            <description>desc SSTARUN5B</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN6A</name>
                            <description>desc SSTARUN6A</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN6B</name>
                            <description>desc SSTARUN6B</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN7A</name>
                            <description>desc SSTARUN7A</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN7B</name>
                            <description>desc SSTARUN7B</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN8A</name>
                            <description>desc SSTARUN8A</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN8B</name>
                            <description>desc SSTARUN8B</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
