pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>SSTARUNR2</name>
                    <description>desc SSTARUNR2</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SSTARUN1A2</name>
                            <description>desc SSTARUN1A2</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN1B2</name>
                            <description>desc SSTARUN1B2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN2A2</name>
                            <description>desc SSTARUN2A2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN2B2</name>
                            <description>desc SSTARUN2B2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN3A2</name>
                            <description>desc SSTARUN3A2</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN3B2</name>
                            <description>desc SSTARUN3B2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN4A2</name>
                            <description>desc SSTARUN4A2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN4B2</name>
                            <description>desc SSTARUN4B2</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN5A2</name>
                            <description>desc SSTARUN5A2</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN5B2</name>
                            <description>desc SSTARUN5B2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN6A2</name>
                            <description>desc SSTARUN6A2</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN6B2</name>
                            <description>desc SSTARUN6B2</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN7A2</name>
                            <description>desc SSTARUN7A2</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN7B2</name>
                            <description>desc SSTARUN7B2</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN8A2</name>
                            <description>desc SSTARUN8A2</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN8B2</name>
                            <description>desc SSTARUN8B2</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTADIDLR</name>
                    <description>desc SSTADIDLR</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DLYSTRGU1</name>
                            <description>desc DLYSTRGU1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYSTRGU2</name>
                            <description>desc DLYSTRGU2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYSTRGU3</name>
                            <description>desc DLYSTRGU3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYSTRGU4</name>
                            <description>desc DLYSTRGU4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYSTRGU5</name>
                            <description>desc DLYSTRGU5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYSTRGU6</name>
                            <description>desc DLYSTRGU6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYSTRGU7</name>
                            <description>desc DLYSTRGU7</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYSTRGU8</name>
                            <description>desc DLYSTRGU8</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GCTLR</name>
                    <description>desc GCTLR</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF0</resetMask>
                    <fields>
                        <field>
                            <name>BKDLY1</name>
                            <description>desc BKDLY1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY2</name>
                            <description>desc BKDLY2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY3</name>
                            <description>desc BKDLY3</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY4</name>
                            <description>desc BKDLY4</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY5</name>
                            <description>desc BKDLY5</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY6</name>
                            <description>desc BKDLY6</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY7</name>
                            <description>desc BKDLY7</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY8</name>
                            <description>desc BKDLY8</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GBCONR</name>
                    <description>desc GBCONR</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3F</resetValue>
                    <resetMask>0xC0FF00FF</resetMask>
                    <fields>
                        <field>
                            <name>BTRU1EN</name>
                            <description>desc BTRU1EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU2EN</name>
                            <description>desc BTRU2EN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU3EN</name>
                            <description>desc BTRU3EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU4EN</name>
                            <description>desc BTRU4EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU5EN</name>
                            <description>desc BTRU5EN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU6EN</name>
                            <description>desc BTRU6EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU7EN</name>
                            <description>desc BTRU7EN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU8EN</name>
                            <description>desc BTRU8EN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU1SFT</name>
                            <description>desc BTRU1SFT</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTRU2SFT</name>
                            <description>desc BTRU2SFT</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTRU3SFT</name>
                            <description>desc BTRU3SFT</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTRU4SFT</name>
                            <description>desc BTRU4SFT</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTRU5SFT</name>
                            <description>desc BTRU5SFT</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTRU6SFT</name>
                            <description>desc BTRU6SFT</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTRU7SFT</name>
                            <description>desc BTRU7SFT</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTRU8SFT</name>
                            <description>desc BTRU8SFT</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OSTBTRU1</name>
                            <description>desc OSTBTRU1</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSTENU1</name>
                            <description>desc OSTENU1</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GBSFLR</name>
                    <description>desc GBSFLR</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>U1BTRENF</name>
                            <description>desc U1BTRENF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U2BTRENF</name>
                            <description>desc U2BTRENF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U3BTRENF</name>
                            <description>desc U3BTRENF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U4BTRENF</name>
                            <description>desc U4BTRENF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U5BTRENF</name>
                            <description>desc U5BTRENF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U6BTRENF</name>
                            <description>desc U6BTRENF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U7BTRENF</name>
                            <description>desc U7BTRENF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U8BTRENF</name>
                            <description>desc U8BTRENF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
