pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>CTL6</name>
                    <description>desc CTL6</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x6DB6DB</resetMask>
                    <fields>
                        <field>
                            <name>EMBIN1S</name>
                            <description>desc EMBIN1S</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBIN2S</name>
                            <description>desc EMBIN2S</description>
                            <msb>4</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBIN3S</name>
                            <description>desc EMBIN3S</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBIN4S</name>
                            <description>desc EMBIN4S</description>
                            <msb>10</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBIN5S</name>
                            <description>desc EMBIN5S</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBIN6S</name>
                            <description>desc EMBIN6S</description>
                            <msb>16</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBIN7S</name>
                            <description>desc EMBIN7S</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBIN8S</name>
                            <description>desc EMBIN8S</description>
                            <msb>22</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="HRPWM_EMB1">
            <name>HRPWM_EMB2</name>
            <description>desc HRPWM_EMB</description>
            <groupName>HRPWM_EMB</groupName>
            <baseAddress>0x40036440</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM_EMB1">
            <name>HRPWM_EMB3</name>
            <description>desc HRPWM_EMB</description>
            <groupName>HRPWM_EMB</groupName>
            <baseAddress>0x40036480</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM_EMB1">
            <name>HRPWM_EMB4</name>
            <description>desc HRPWM_EMB</description>
            <groupName>HRPWM_EMB</groupName>
            <baseAddress>0x400364C0</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM_EMB1">
            <name>HRPWM_EMB5</name>
            <description>desc HRPWM_EMB</description>
            <groupName>HRPWM_EMB</groupName>
            <baseAddress>0x40036500</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM_EMB1">
            <name>HRPWM_EMB6</name>
            <description>desc HRPWM_EMB</description>
            <groupName>HRPWM_EMB</groupName>
            <baseAddress>0x40036540</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM_EMB1">
            <name>HRPWM_EMB7</name>
            <description>desc HRPWM_EMB</description>
            <groupName>HRPWM_EMB</groupName>
            <baseAddress>0x40036580</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="HRPWM_EMB1">
            <name>HRPWM_EMB8</name>
            <description>desc HRPWM_EMB</description>
            <groupName>HRPWM_EMB</groupName>
            <baseAddress>0x400365C0</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>I2C1</name>
            <description>desc I2C</description>
            <groupName>I2C</groupName>
            <baseAddress>0x4004E000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0x87FF</resetMask>
                    <fields>
                        <field>
                            <name>PE</name>
                            <description>desc PE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBUS</name>
                            <description>desc SMBUS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBALRTEN</name>
                            <description>desc SMBALRTEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBDEFAULTEN</name>
                            <description>desc SMBDEFAULTEN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBHOSTEN</name>
                            <description>desc SMBHOSTEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBALRTPTEN</name>
                            <description>desc SMBALRTPTEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GCEN</name>
                            <description>desc GCEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESTART</name>
                            <description>desc RESTART</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>START</name>
                            <description>desc START</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>desc STOP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>desc ACK</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRST</name>
                            <description>desc SWRST</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR2</name>
                    <description>desc CR2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF8FBDF</resetMask>
                    <fields>
                        <field>
                            <name>STARTIE</name>
                            <description>desc STARTIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLADDR0IE</name>
                            <description>desc SLADDR0IE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLADDR1IE</name>
                            <description>desc SLADDR1IE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TENDIE</name>
                            <description>desc TENDIE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STOPIE</name>
                            <description>desc STOPIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFULLIE</name>
                            <description>desc RFULLIE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TEMPTYIE</name>
                            <description>desc TEMPTYIE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLADDR2IE</name>
                            <description>desc SLADDR2IE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARLOIE</name>
                            <description>desc ARLOIE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFREQIE</name>
                            <description>desc RFREQIE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NACKIE</name>
                            <description>desc NACKIE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PECERRIE</name>
                            <description>desc PECERRIE</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMOUTIE</name>
                            <description>desc TMOUTIE</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCIE</name>
                            <description>desc TCIE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBALRTPTIE</name>
                            <description>desc SMBALRTPTIE</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GENCALLIE</name>
                            <description>desc GENCALLIE</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBDEFAULTIE</name>
                            <description>desc SMBDEFAULTIE</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBHOSTIE</name>
                            <description>desc SMBHOSTIE</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBALRTIE</name>
                            <description>desc SMBALRTIE</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR3</name>
                    <description>desc CR3</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x6</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>TMOUTEN</name>
                            <description>desc TMOUTEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTMOUT</name>
                            <description>desc LTMOUT</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HTMOUT</name>
                            <description>desc HTMOUT</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TEXTEN</name>
                            <description>desc TEXTEN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMCKDIV</name>
                            <description>desc TMCKDIV</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FACKEN</name>
                            <description>desc FACKEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MRTEICTL</name>
                            <description>desc MRTEICTL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR4</name>
                    <description>desc CR4</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x301B07</resetValue>
                    <resetMask>0xF1C00</resetMask>
                    <fields>
                        <field>
                            <name>BUSWAIT</name>
                            <description>desc BUSWAIT</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NACKTRA_CLREN</name>
                            <description>desc NACKTRA_CLREN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSFREE_CLREN</name>
                            <description>desc BUSFREE_CLREN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDADLY</name>
                            <description>desc SDADLY</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLR0</name>
                    <description>desc SLR0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0x7FF93FF</resetMask>
                    <fields>
                        <field>
                            <name>SLADDR0</name>
                            <description>desc SLADDR0</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLADDR0EN</name>
                            <description>desc SLADDR0EN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRMOD0</name>
                            <description>desc ADDRMOD0</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSLADDR0</name>
                            <description>desc MSLADDR0</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK0EN</name>
                            <description>desc MASK0EN</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
