pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>FCG0PC</name>
                    <description>desc FCG0PC</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF0001</resetMask>
                    <fields>
                        <field>
                            <name>PRT0</name>
                            <description>desc PRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCG0PCWE</name>
                            <description>desc FCG0PCWE</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWRC1</name>
                    <description>desc PWRC1</description>
                    <addressOffset>0x4C04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xC0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>VPLLSD</name>
                            <description>desc VPLLSD</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWRC4</name>
                    <description>desc PWRC4</description>
                    <addressOffset>0x4C10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0xC0</resetMask>
                    <fields>
                        <field>
                            <name>ADBUFS</name>
                            <description>desc ADBUFS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADBUFE</name>
                            <description>desc ADBUFE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVDCR0</name>
                    <description>desc PVDCR0</description>
                    <addressOffset>0x4C14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x61</resetMask>
                    <fields>
                        <field>
                            <name>EXVCCINEN</name>
                            <description>desc EXVCCINEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1EN</name>
                            <description>desc PVD1EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2EN</name>
                            <description>desc PVD2EN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVDCR1</name>
                    <description>desc PVDCR1</description>
                    <addressOffset>0x4C18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>PVD1IRE</name>
                            <description>desc PVD1IRE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1IRS</name>
                            <description>desc PVD1IRS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1CMPOE</name>
                            <description>desc PVD1CMPOE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2IRE</name>
                            <description>desc PVD2IRE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2IRS</name>
                            <description>desc PVD2IRS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2CMPOE</name>
                            <description>desc PVD2CMPOE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVDFCR</name>
                    <description>desc PVDFCR</description>
                    <addressOffset>0x4C1C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x11</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>PVD1NFDIS</name>
                            <description>desc PVD1NFDIS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1NFCKS</name>
                            <description>desc PVD1NFCKS</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2NFDIS</name>
                            <description>desc PVD2NFDIS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2NFCKS</name>
                            <description>desc PVD2NFCKS</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVDLCR</name>
                    <description>desc PVDLCR</description>
                    <addressOffset>0x4C20</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>PVD1LVL</name>
                            <description>desc PVD1LVL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2LVL</name>
                            <description>desc PVD2LVL</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWRC6</name>
                    <description>desc PWRC6</description>
                    <addressOffset>0x4C44</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SWRCMP</name>
                            <description>desc SWRCMP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDRCMP</name>
                            <description>desc WDRCMP</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRIOCLR</name>
                            <description>desc SWRIOCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDRIOCLR</name>
                            <description>desc WDRIOCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRDAC</name>
                            <description>desc SWRDAC</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDRDAC</name>
                            <description>desc WDRDAC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRTNE</name>
                            <description>desc SWRTNE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDRTNE</name>
                            <description>desc WDRTNE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAMPC0</name>
                    <description>desc RAMPC0</description>
                    <addressOffset>0x4CE0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x187</resetMask>
                    <fields>
                        <field>
                            <name>RAMPDC0</name>
                            <description>desc RAMPDC0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPDC1</name>
                            <description>desc RAMPDC1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPDC2</name>
                            <description>desc RAMPDC2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPDC7</name>
                            <description>desc RAMPDC7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPDC8</name>
                            <description>desc RAMPDC8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PRAMLPC</name>
                    <description>desc PRAMLPC</description>
                    <addressOffset>0x4CE8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x864</resetMask>
                    <fields>
                        <field>
                            <name>PRAMPDC2</name>
                            <description>desc PRAMPDC2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRAMPDC5</name>
                            <description>desc PRAMPDC5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRAMPDC6</name>
                            <description>desc PRAMPDC6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRAMPDC11</name>
                            <description>desc PRAMPDC11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPMCSR</name>
                    <description>desc LPMCSR</description>
                    <addressOffset>0x4CEC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>LPMF</name>
                            <description>desc LPMF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPMCSCR</name>
                    <description>desc LPMCSCR</description>
                    <addressOffset>0x4CEE</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>LPMFC</name>
                            <description>desc LPMFC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVDICR</name>
                    <description>desc PVDICR</description>
                    <addressOffset>0x4CF0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>PVD1NMIS</name>
                            <description>desc PVD1NMIS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1EDGS</name>
                            <description>desc PVD1EDGS</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2NMIS</name>
                            <description>desc PVD2NMIS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2EDGS</name>
                            <description>desc PVD2EDGS</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVDDSR</name>
                    <description>desc PVDDSR</description>
                    <addressOffset>0x4CF4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x11</resetValue>
                    <resetMask>0x33</resetMask>
                    <fields>
                        <field>
                            <name>PVD1MON</name>
                            <description>desc PVD1MON</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1DETFLG</name>
                            <description>desc PVD1DETFLG</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2MON</name>
                            <description>desc PVD2MON</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2DETFLG</name>
                            <description>desc PVD2DETFLG</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STPMCR</name>
                    <description>desc STPMCR</description>
                    <addressOffset>0xC00C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8003</resetMask>
                    <fields>
                        <field>
                            <name>FLNWT</name>
                            <description>desc FLNWT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKSMRC</name>
                            <description>desc CKSMRC</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>desc STOP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
