pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>FLT0EXMAX</name>
                    <description>desc FLT0EXMAX</description>
                    <addressOffset>0x130</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x80000000</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>EXMAXCHCH</name>
                            <description>desc EXMAXCHCH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXMAX</name>
                            <description>desc EXMAX</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0EXMIN</name>
                    <description>desc FLT0EXMIN</description>
                    <addressOffset>0x134</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x7FFFFF00</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>EXMINCHCH</name>
                            <description>desc EXMINCHCH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXMIN</name>
                            <description>desc EXMIN</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0CNVTIMR</name>
                    <description>desc FLT0CNVTIMR</description>
                    <addressOffset>0x138</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFF0</resetMask>
                    <fields>
                        <field>
                            <name>CNVCNT</name>
                            <description>desc CNVCNT</description>
                            <msb>31</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0CNVTHRE</name>
                    <description>desc FLT0CNVTHRE</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x24</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>CNVTHRE</name>
                            <description>desc CNVTHRE</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0FIFOCTL</name>
                    <description>desc FLT0FIFOCTL</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x19FEF</resetMask>
                    <fields>
                        <field>
                            <name>SDFFIL</name>
                            <description>desc SDFFIL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WTSYNCEN</name>
                            <description>desc WTSYNCEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FFSYNCLREN</name>
                            <description>desc FFSYNCLREN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WTSCLREN</name>
                            <description>desc WTSCLREN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDFFST</name>
                            <description>desc SDFFST</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WTSYNFLG</name>
                            <description>desc WTSYNFLG</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WTSYNCLR</name>
                            <description>desc WTSYNCLR</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0DATFIFO</name>
                    <description>desc FLT0DATFIFO</description>
                    <addressOffset>0x144</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>FIFO_JDATACH</name>
                            <description>desc FIFO_JDATACH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FIFO_JDATA</name>
                            <description>desc FIFO_JDATA</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0AWHT2</name>
                    <description>desc FLT0AWHT2</description>
                    <addressOffset>0x148</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF0000</resetMask>
                    <fields>
                        <field>
                            <name>AWHT2</name>
                            <description>desc AWHT2</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0AWLT2</name>
                    <description>desc FLT0AWLT2</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF0000</resetMask>
                    <fields>
                        <field>
                            <name>AWLT2</name>
                            <description>desc AWLT2</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0CPARM</name>
                    <description>desc FLT0CPARM</description>
                    <addressOffset>0x150</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x800F1FFF</resetMask>
                    <fields>
                        <field>
                            <name>EN_CEVT1</name>
                            <description>desc EN_CEVT1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN_CEVT2</name>
                            <description>desc EN_CEVT2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HZEN</name>
                            <description>desc HZEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT1SEL</name>
                            <description>desc CEVT1SEL</description>
                            <msb>4</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVFILTER_EN</name>
                            <description>desc CEVFILTER_EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT2SEL</name>
                            <description>desc CEVT2SEL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FILTER_CH</name>
                            <description>desc FILTER_CH</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT1DIGFILTSEL</name>
                            <description>desc CEVT1DIGFILTSEL</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT2DIGFILTSEL</name>
                            <description>desc CEVT2DIGFILTSEL</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BK_CROSS_ZERO</name>
                            <description>desc BK_CROSS_ZERO</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FILINIT</name>
                            <description>desc FILINIT</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0EVTFITCTL</name>
                    <description>desc FLT0EVTFITCTL</description>
                    <addressOffset>0x154</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F1F1F1F</resetMask>
                    <fields>
                        <field>
                            <name>SAMPWIN1</name>
                            <description>desc SAMPWIN1</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THRESH1</name>
                            <description>desc THRESH1</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAMPWIN2</name>
                            <description>desc SAMPWIN2</description>
                            <msb>20</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THRESH2</name>
                            <description>desc THRESH2</description>
                            <msb>28</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1CR1</name>
                    <description>desc FLT1CR1</description>
                    <addressOffset>0x180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE72E7F7B</resetMask>
                    <fields>
                        <field>
                            <name>DFEN</name>
                            <description>desc DFEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JSWSTART</name>
                            <description>desc JSWSTART</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>JSYNC</name>
                            <description>desc JSYNC</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JSCAN</name>
                            <description>desc JSCAN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JDMAEN</name>
                            <description>desc JDMAEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JSCAN_TYPE</name>
                            <description>desc JSCAN_TYPE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JEXTSEL</name>
                            <description>desc JEXTSEL</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JEXTEN</name>
                            <description>desc JEXTEN</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSWSTART</name>
                            <description>desc RSWSTART</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RCONT</name>
                            <description>desc RCONT</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSYNC</name>
                            <description>desc RSYNC</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDMAEN</name>
                            <description>desc RDMAEN</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCH</name>
                            <description>desc RCH</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAST</name>
                            <description>desc FAST</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWFSEL</name>
                            <description>desc AWFSEL</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVDEL</name>
                            <description>desc OVDEL</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1CR2</name>
                    <description>desc FLT1CR2</description>
                    <addressOffset>0x184</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF1F</resetMask>
                    <fields>
                        <field>
                            <name>JEOCIE</name>
                            <description>desc JEOCIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REOCIE</name>
                            <description>desc REOCIE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JOVRIE</name>
                            <description>desc JOVRIE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROVRIE</name>
                            <description>desc ROVRIE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWDIE</name>
                            <description>desc AWDIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXCH</name>
                            <description>desc EXCH</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWDCH</name>
                            <description>desc AWDCH</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
