pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>FLT1CPARM</name>
                    <description>desc FLT1CPARM</description>
                    <addressOffset>0x1D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x800F1FFF</resetMask>
                    <fields>
                        <field>
                            <name>EN_CEVT1</name>
                            <description>desc EN_CEVT1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN_CEVT2</name>
                            <description>desc EN_CEVT2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HZEN</name>
                            <description>desc HZEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT1SEL</name>
                            <description>desc CEVT1SEL</description>
                            <msb>4</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVFILTER_EN</name>
                            <description>desc CEVFILTER_EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT2SEL</name>
                            <description>desc CEVT2SEL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FILTER_CH</name>
                            <description>desc FILTER_CH</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT1DIGFILTSEL</name>
                            <description>desc CEVT1DIGFILTSEL</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT2DIGFILTSEL</name>
                            <description>desc CEVT2DIGFILTSEL</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BK_CROSS_ZERO</name>
                            <description>desc BK_CROSS_ZERO</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FILINIT</name>
                            <description>desc FILINIT</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1EVTFITCTL</name>
                    <description>desc FLT1EVTFITCTL</description>
                    <addressOffset>0x1D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F1F1F1F</resetMask>
                    <fields>
                        <field>
                            <name>SAMPWIN1</name>
                            <description>desc SAMPWIN1</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THRESH1</name>
                            <description>desc THRESH1</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAMPWIN2</name>
                            <description>desc SAMPWIN2</description>
                            <msb>20</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THRESH2</name>
                            <description>desc THRESH2</description>
                            <msb>28</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2CR1</name>
                    <description>desc FLT2CR1</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE72E7F7B</resetMask>
                    <fields>
                        <field>
                            <name>DFEN</name>
                            <description>desc DFEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JSWSTART</name>
                            <description>desc JSWSTART</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>JSYNC</name>
                            <description>desc JSYNC</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JSCAN</name>
                            <description>desc JSCAN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JDMAEN</name>
                            <description>desc JDMAEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JSCAN_TYPE</name>
                            <description>desc JSCAN_TYPE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JEXTSEL</name>
                            <description>desc JEXTSEL</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JEXTEN</name>
                            <description>desc JEXTEN</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSWSTART</name>
                            <description>desc RSWSTART</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RCONT</name>
                            <description>desc RCONT</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSYNC</name>
                            <description>desc RSYNC</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDMAEN</name>
                            <description>desc RDMAEN</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCH</name>
                            <description>desc RCH</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAST</name>
                            <description>desc FAST</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWFSEL</name>
                            <description>desc AWFSEL</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVDEL</name>
                            <description>desc OVDEL</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2CR2</name>
                    <description>desc FLT2CR2</description>
                    <addressOffset>0x204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF1F</resetMask>
                    <fields>
                        <field>
                            <name>JEOCIE</name>
                            <description>desc JEOCIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REOCIE</name>
                            <description>desc REOCIE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JOVRIE</name>
                            <description>desc JOVRIE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROVRIE</name>
                            <description>desc ROVRIE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWDIE</name>
                            <description>desc AWDIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXCH</name>
                            <description>desc EXCH</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWDCH</name>
                            <description>desc AWDCH</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2ISR</name>
                    <description>desc FLT2ISR</description>
                    <addressOffset>0x208</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x601F</resetMask>
                    <fields>
                        <field>
                            <name>JEOCF</name>
                            <description>desc JEOCF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REOCF</name>
                            <description>desc REOCF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JOVRF</name>
                            <description>desc JOVRF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ROVRF</name>
                            <description>desc ROVRF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AWDF</name>
                            <description>desc AWDF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JCIP</name>
                            <description>desc JCIP</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCIP</name>
                            <description>desc RCIP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2ICR</name>
                    <description>desc FLT2ICR</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xD</resetMask>
                    <fields>
                        <field>
                            <name>CLRJEOCF</name>
                            <description>desc CLRJEOCF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRJOVRF</name>
                            <description>desc CLRJOVRF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRROVRF</name>
                            <description>desc CLRROVRF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2JCHGR</name>
                    <description>desc FLT2JCHGR</description>
                    <addressOffset>0x210</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>JCHG</name>
                            <description>desc JCHG</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2FCR</name>
                    <description>desc FLT2FCR</description>
                    <addressOffset>0x214</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE3FF00FF</resetMask>
                    <fields>
                        <field>
                            <name>IOSR</name>
                            <description>desc IOSR</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FOSR</name>
                            <description>desc FOSR</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORD</name>
                            <description>desc FORD</description>
                            <msb>31</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2JDATAR</name>
                    <description>desc FLT2JDATAR</description>
                    <addressOffset>0x218</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>JDATACH</name>
                            <description>desc JDATACH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JDATA</name>
                            <description>desc JDATA</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2RDATAR</name>
                    <description>desc FLT2RDATAR</description>
                    <addressOffset>0x21C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF17</resetMask>
                    <fields>
                        <field>
                            <name>RDATACH</name>
                            <description>desc RDATACH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RPEND</name>
                            <description>desc RPEND</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDATA</name>
                            <description>desc RDATA</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2AWHTR</name>
                    <description>desc FLT2AWHTR</description>
                    <addressOffset>0x220</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF0F</resetMask>
                    <fields>
                        <field>
                            <name>BKAWH</name>
                            <description>desc BKAWH</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWHT</name>
                            <description>desc AWHT</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
