pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>FLT2AWLTR</name>
                    <description>desc FLT2AWLTR</description>
                    <addressOffset>0x224</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF0F</resetMask>
                    <fields>
                        <field>
                            <name>BKAWL</name>
                            <description>desc BKAWL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWLT</name>
                            <description>desc AWLT</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2AWSR</name>
                    <description>desc FLT2AWSR</description>
                    <addressOffset>0x228</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AWLTF</name>
                            <description>desc AWLTF</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AWHTF</name>
                            <description>desc AWHTF</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HZF</name>
                            <description>desc HZF</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2AWCFR</name>
                    <description>desc FLT2AWCFR</description>
                    <addressOffset>0x22C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLRAWLTF</name>
                            <description>desc CLRAWLTF</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRAWHTF</name>
                            <description>desc CLRAWHTF</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRHZF</name>
                            <description>desc CLRHZF</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2EXMAX</name>
                    <description>desc FLT2EXMAX</description>
                    <addressOffset>0x230</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x80000000</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>EXMAXCHCH</name>
                            <description>desc EXMAXCHCH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXMAX</name>
                            <description>desc EXMAX</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2EXMIN</name>
                    <description>desc FLT2EXMIN</description>
                    <addressOffset>0x234</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x7FFFFF00</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>EXMINCHCH</name>
                            <description>desc EXMINCHCH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXMIN</name>
                            <description>desc EXMIN</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2CNVTIMR</name>
                    <description>desc FLT2CNVTIMR</description>
                    <addressOffset>0x238</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFF0</resetMask>
                    <fields>
                        <field>
                            <name>CNVCNT</name>
                            <description>desc CNVCNT</description>
                            <msb>31</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2CNVTHRE</name>
                    <description>desc FLT2CNVTHRE</description>
                    <addressOffset>0x23C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x24</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>CNVTHRE</name>
                            <description>desc CNVTHRE</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2FIFOCTL</name>
                    <description>desc FLT2FIFOCTL</description>
                    <addressOffset>0x240</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x19FEF</resetMask>
                    <fields>
                        <field>
                            <name>SDFFIL</name>
                            <description>desc SDFFIL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WTSYNCEN</name>
                            <description>desc WTSYNCEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FFSYNCLREN</name>
                            <description>desc FFSYNCLREN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WTSCLREN</name>
                            <description>desc WTSCLREN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDFFST</name>
                            <description>desc SDFFST</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WTSYNFLG</name>
                            <description>desc WTSYNFLG</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WTSYNCLR</name>
                            <description>desc WTSYNCLR</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2DATFIFO</name>
                    <description>desc FLT2DATFIFO</description>
                    <addressOffset>0x244</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>FIFO_JDATACH</name>
                            <description>desc FIFO_JDATACH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FIFO_JDATA</name>
                            <description>desc FIFO_JDATA</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2AWHT2</name>
                    <description>desc FLT2AWHT2</description>
                    <addressOffset>0x248</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF0000</resetMask>
                    <fields>
                        <field>
                            <name>AWHT2</name>
                            <description>desc AWHT2</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2AWLT2</name>
                    <description>desc FLT2AWLT2</description>
                    <addressOffset>0x24C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF0000</resetMask>
                    <fields>
                        <field>
                            <name>AWLT2</name>
                            <description>desc AWLT2</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2CPARM</name>
                    <description>desc FLT2CPARM</description>
                    <addressOffset>0x250</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x800F1FFF</resetMask>
                    <fields>
                        <field>
                            <name>EN_CEVT1</name>
                            <description>desc EN_CEVT1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN_CEVT2</name>
                            <description>desc EN_CEVT2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HZEN</name>
                            <description>desc HZEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT1SEL</name>
                            <description>desc CEVT1SEL</description>
                            <msb>4</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVFILTER_EN</name>
                            <description>desc CEVFILTER_EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT2SEL</name>
                            <description>desc CEVT2SEL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FILTER_CH</name>
                            <description>desc FILTER_CH</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT1DIGFILTSEL</name>
                            <description>desc CEVT1DIGFILTSEL</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT2DIGFILTSEL</name>
                            <description>desc CEVT2DIGFILTSEL</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BK_CROSS_ZERO</name>
                            <description>desc BK_CROSS_ZERO</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FILINIT</name>
                            <description>desc FILINIT</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2EVTFITCTL</name>
                    <description>desc FLT2EVTFITCTL</description>
                    <addressOffset>0x254</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F1F1F1F</resetMask>
                    <fields>
                        <field>
                            <name>SAMPWIN1</name>
                            <description>desc SAMPWIN1</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THRESH1</name>
                            <description>desc THRESH1</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAMPWIN2</name>
                            <description>desc SAMPWIN2</description>
                            <msb>20</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THRESH2</name>
                            <description>desc THRESH2</description>
                            <msb>28</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
