pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>FLT3CR1</name>
                    <description>desc FLT3CR1</description>
                    <addressOffset>0x280</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE72E7F7B</resetMask>
                    <fields>
                        <field>
                            <name>DFEN</name>
                            <description>desc DFEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JSWSTART</name>
                            <description>desc JSWSTART</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>JSYNC</name>
                            <description>desc JSYNC</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JSCAN</name>
                            <description>desc JSCAN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JDMAEN</name>
                            <description>desc JDMAEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JSCAN_TYPE</name>
                            <description>desc JSCAN_TYPE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JEXTSEL</name>
                            <description>desc JEXTSEL</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JEXTEN</name>
                            <description>desc JEXTEN</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSWSTART</name>
                            <description>desc RSWSTART</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCONT</name>
                            <description>desc RCONT</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSYNC</name>
                            <description>desc RSYNC</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDMAEN</name>
                            <description>desc RDMAEN</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCH</name>
                            <description>desc RCH</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAST</name>
                            <description>desc FAST</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWFSEL</name>
                            <description>desc AWFSEL</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVDEL</name>
                            <description>desc OVDEL</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3CR2</name>
                    <description>desc FLT3CR2</description>
                    <addressOffset>0x284</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF1F</resetMask>
                    <fields>
                        <field>
                            <name>JEOCIE</name>
                            <description>desc JEOCIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REOCIE</name>
                            <description>desc REOCIE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JOVRIE</name>
                            <description>desc JOVRIE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROVRIE</name>
                            <description>desc ROVRIE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWDIE</name>
                            <description>desc AWDIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXCH</name>
                            <description>desc EXCH</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWDCH</name>
                            <description>desc AWDCH</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3ISR</name>
                    <description>desc FLT3ISR</description>
                    <addressOffset>0x288</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x601F</resetMask>
                    <fields>
                        <field>
                            <name>JEOCF</name>
                            <description>desc JEOCF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REOCF</name>
                            <description>desc REOCF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JOVRF</name>
                            <description>desc JOVRF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ROVRF</name>
                            <description>desc ROVRF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AWDF</name>
                            <description>desc AWDF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JCIP</name>
                            <description>desc JCIP</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCIP</name>
                            <description>desc RCIP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3ICR</name>
                    <description>desc FLT3ICR</description>
                    <addressOffset>0x28C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xD</resetMask>
                    <fields>
                        <field>
                            <name>CLRJEOCF</name>
                            <description>desc CLRJEOCF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRJOVRF</name>
                            <description>desc CLRJOVRF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRROVRF</name>
                            <description>desc CLRROVRF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3JCHGR</name>
                    <description>desc FLT3JCHGR</description>
                    <addressOffset>0x290</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>JCHG</name>
                            <description>desc JCHG</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3FCR</name>
                    <description>desc FLT3FCR</description>
                    <addressOffset>0x294</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE3FF00FF</resetMask>
                    <fields>
                        <field>
                            <name>IOSR</name>
                            <description>desc IOSR</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FOSR</name>
                            <description>desc FOSR</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORD</name>
                            <description>desc FORD</description>
                            <msb>31</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3JDATAR</name>
                    <description>desc FLT3JDATAR</description>
                    <addressOffset>0x298</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>JDATACH</name>
                            <description>desc JDATACH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JDATA</name>
                            <description>desc JDATA</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3RDATAR</name>
                    <description>desc FLT3RDATAR</description>
                    <addressOffset>0x29C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF17</resetMask>
                    <fields>
                        <field>
                            <name>RDATACH</name>
                            <description>desc RDATACH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RPEND</name>
                            <description>desc RPEND</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDATA</name>
                            <description>desc RDATA</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3AWHTR</name>
                    <description>desc FLT3AWHTR</description>
                    <addressOffset>0x2A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF0F</resetMask>
                    <fields>
                        <field>
                            <name>BKAWH</name>
                            <description>desc BKAWH</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWHT</name>
                            <description>desc AWHT</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3AWLTR</name>
                    <description>desc FLT3AWLTR</description>
                    <addressOffset>0x2A4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF0F</resetMask>
                    <fields>
                        <field>
                            <name>BKAWL</name>
                            <description>desc BKAWL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWLT</name>
                            <description>desc AWLT</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3AWSR</name>
                    <description>desc FLT3AWSR</description>
                    <addressOffset>0x2A8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AWLTF</name>
                            <description>desc AWLTF</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AWHTF</name>
                            <description>desc AWHTF</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HZF</name>
                            <description>desc HZF</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3AWCFR</name>
                    <description>desc FLT3AWCFR</description>
                    <addressOffset>0x2AC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLRAWLTF</name>
                            <description>desc CLRAWLTF</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRAWHTF</name>
                            <description>desc CLRAWHTF</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRHZF</name>
                            <description>desc CLRHZF</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3EXMAX</name>
                    <description>desc FLT3EXMAX</description>
                    <addressOffset>0x2B0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x80000000</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>EXMAXCHCH</name>
                            <description>desc EXMAXCHCH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXMAX</name>
                            <description>desc EXMAX</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
