pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>FLT3EXMIN</name>
                    <description>desc FLT3EXMIN</description>
                    <addressOffset>0x2B4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x7FFFFF00</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>EXMINCHCH</name>
                            <description>desc EXMINCHCH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXMIN</name>
                            <description>desc EXMIN</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3CNVTIMR</name>
                    <description>desc FLT3CNVTIMR</description>
                    <addressOffset>0x2B8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFF0</resetMask>
                    <fields>
                        <field>
                            <name>CNVCNT</name>
                            <description>desc CNVCNT</description>
                            <msb>31</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3CNVTHRE</name>
                    <description>desc FLT3CNVTHRE</description>
                    <addressOffset>0x2BC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x24</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>CNVTHRE</name>
                            <description>desc CNVTHRE</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3FIFOCTL</name>
                    <description>desc FLT3FIFOCTL</description>
                    <addressOffset>0x2C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x19FEF</resetMask>
                    <fields>
                        <field>
                            <name>SDFFIL</name>
                            <description>desc SDFFIL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WTSYNCEN</name>
                            <description>desc WTSYNCEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FFSYNCLREN</name>
                            <description>desc FFSYNCLREN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WTSCLREN</name>
                            <description>desc WTSCLREN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDFFST</name>
                            <description>desc SDFFST</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WTSYNFLG</name>
                            <description>desc WTSYNFLG</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WTSYNCLR</name>
                            <description>desc WTSYNCLR</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3DATFIFO</name>
                    <description>desc FLT3DATFIFO</description>
                    <addressOffset>0x2C4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF07</resetMask>
                    <fields>
                        <field>
                            <name>FIFO_JDATACH</name>
                            <description>desc FIFO_JDATACH</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FIFO_JDATA</name>
                            <description>desc FIFO_JDATA</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3AWHT2</name>
                    <description>desc FLT3AWHT2</description>
                    <addressOffset>0x2C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF0000</resetMask>
                    <fields>
                        <field>
                            <name>AWHT2</name>
                            <description>desc AWHT2</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3AWLT2</name>
                    <description>desc FLT3AWLT2</description>
                    <addressOffset>0x2CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF0000</resetMask>
                    <fields>
                        <field>
                            <name>AWLT2</name>
                            <description>desc AWLT2</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3CPARM</name>
                    <description>desc FLT3CPARM</description>
                    <addressOffset>0x2D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x800F1FFF</resetMask>
                    <fields>
                        <field>
                            <name>EN_CEVT1</name>
                            <description>desc EN_CEVT1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN_CEVT2</name>
                            <description>desc EN_CEVT2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HZEN</name>
                            <description>desc HZEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT1SEL</name>
                            <description>desc CEVT1SEL</description>
                            <msb>4</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVFILTER_EN</name>
                            <description>desc CEVFILTER_EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT2SEL</name>
                            <description>desc CEVT2SEL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FILTER_CH</name>
                            <description>desc FILTER_CH</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT1DIGFILTSEL</name>
                            <description>desc CEVT1DIGFILTSEL</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CEVT2DIGFILTSEL</name>
                            <description>desc CEVT2DIGFILTSEL</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BK_CROSS_ZERO</name>
                            <description>desc BK_CROSS_ZERO</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FILINIT</name>
                            <description>desc FILINIT</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3EVTFITCTL</name>
                    <description>desc FLT3EVTFITCTL</description>
                    <addressOffset>0x2D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F1F1F1F</resetMask>
                    <fields>
                        <field>
                            <name>SAMPWIN1</name>
                            <description>desc SAMPWIN1</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THRESH1</name>
                            <description>desc THRESH1</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAMPWIN2</name>
                            <description>desc SAMPWIN2</description>
                            <msb>20</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THRESH2</name>
                            <description>desc THRESH2</description>
                            <msb>28</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
