pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
                <register>
                    <name>CTLLEG2</name>
                    <description>desc CTLLEG2</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF0F</resetMask>
                    <fields>
                        <field>
                            <name>TRLPWMLEG1EN</name>
                            <description>desc TRLPWMLEG1EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTPUTSTAGEBYPASS</name>
                            <description>desc OUTPUTSTAGEBYPASS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INPUTPOLINV</name>
                            <description>desc INPUTPOLINV</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ANPCEN</name>
                            <description>desc ANPCEN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FLTSD</name>
                            <description>desc FLTSD</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FLTSEL</name>
                            <description>desc FLTSEL</description>
                            <msb>15</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLYLEG2</name>
                    <description>desc DLYLEG2</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SHUTDOWNDLY</name>
                            <description>desc SHUTDOWNDLY</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPENDLY</name>
                            <description>desc OPENDLY</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CBCRESUMEDLY</name>
                            <description>desc CBCRESUMEDLY</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRLEG2</name>
                    <description>desc SRLEG2</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>STATUS</name>
                            <description>desc STATUS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MISCCTRL2</name>
                    <description>desc MISCCTRL2</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2000000</resetValue>
                    <resetMask>0x3F555000</resetMask>
                    <fields>
                        <field>
                            <name>LEGT1IN_SEL</name>
                            <description>desc LEGT1IN_SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LEGT2IN_SEL</name>
                            <description>desc LEGT2IN_SEL</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LEGT3IN_SEL</name>
                            <description>desc LEGT3IN_SEL</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LEGT4IN_SEL</name>
                            <description>desc LEGT4IN_SEL</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LEGT5IN_SEL</name>
                            <description>desc LEGT5IN_SEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LEGT6IN_SEL</name>
                            <description>desc LEGT6IN_SEL</description>
                            <msb>22</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LEG_ALIGNDLY</name>
                            <description>desc LEG_ALIGNDLY</description>
                            <msb>29</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REVIDR</name>
                    <description>desc REVIDR</description>
                    <addressOffset>0x3FC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>REVID</name>
                            <description>desc REVID</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
