pyocd/pyOCD/pyocd/debug/svd/data/HC32F558.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>XBAR</name>
            <description>desc XBAR</description>
            <groupName>XBAR</groupName>
            <baseAddress>0x40021000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>HECR1</name>
                    <description>desc HECR1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HECR2</name>
                    <description>desc HECR2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HECR3</name>
                    <description>desc HECR3</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HECR4</name>
                    <description>desc HECR4</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HECR5</name>
                    <description>desc HECR5</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HECR6</name>
                    <description>desc HECR6</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HECR7</name>
                    <description>desc HECR7</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HECR8</name>
                    <description>desc HECR8</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HECR9</name>
                    <description>desc HECR9</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HECR10</name>
                    <description>desc HECR10</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE07F073F</resetMask>
                    <fields>
                        <field>
                            <name>SEL1</name>
                            <description>desc SEL1</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>desc SEL2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>desc SEL3</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>desc STA1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA2</name>
                            <description>desc STA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA3</name>
                            <description>desc STA3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
